
a.out:     формат файла elf64-x86-64


Дизассемблирование раздела .init:

0000000000001000 <_init>:
    1000:	f3 0f 1e fa          	endbr64 
    1004:	48 83 ec 08          	sub    rsp,0x8
    1008:	48 8b 05 d9 2f 00 00 	mov    rax,QWORD PTR [rip+0x2fd9]        # 3fe8 <__gmon_start__>
    100f:	48 85 c0             	test   rax,rax
    1012:	74 02                	je     1016 <_init+0x16>
    1014:	ff d0                	call   rax
    1016:	48 83 c4 08          	add    rsp,0x8
    101a:	c3                   	ret    

Дизассемблирование раздела .plt:

0000000000001020 <.plt>:
    1020:	ff 35 9a 2f 00 00    	push   QWORD PTR [rip+0x2f9a]        # 3fc0 <_GLOBAL_OFFSET_TABLE_+0x8>
    1026:	f2 ff 25 9b 2f 00 00 	bnd jmp QWORD PTR [rip+0x2f9b]        # 3fc8 <_GLOBAL_OFFSET_TABLE_+0x10>
    102d:	0f 1f 00             	nop    DWORD PTR [rax]
    1030:	f3 0f 1e fa          	endbr64 
    1034:	68 00 00 00 00       	push   0x0
    1039:	f2 e9 e1 ff ff ff    	bnd jmp 1020 <.plt>
    103f:	90                   	nop

Дизассемблирование раздела .plt.got:

0000000000001040 <__cxa_finalize@plt>:
    1040:	f3 0f 1e fa          	endbr64 
    1044:	f2 ff 25 ad 2f 00 00 	bnd jmp QWORD PTR [rip+0x2fad]        # 3ff8 <__cxa_finalize@GLIBC_2.2.5>
    104b:	0f 1f 44 00 00       	nop    DWORD PTR [rax+rax*1+0x0]

Дизассемблирование раздела .plt.sec:

0000000000001050 <__printf_chk@plt>:
    1050:	f3 0f 1e fa          	endbr64 

    <15>   DW_AT_comp_dir    : (косвенная строка, смещение: 0x91): /home/kolobaka2000/Рабочий стол/mipt_contests/2_sem/7_th/fact
    <19>   DW_AT_low_pc      : 0x1149
    <21>   DW_AT_high_pc     : 0x1c
    <29>   DW_AT_stmt_list   : 0x0
 <1><2d>: номер аббревиатуры: 2 (DW_TAG_subprogram)
    <2e>   DW_AT_external    : 1
    <2e>   DW_AT_name        : (косвенная строка, смещение: 0xd5): fact
    <32>   DW_AT_decl_file   : 1
    <33>   DW_AT_decl_line   : 3
    <34>   DW_AT_decl_column : 11
    <35>   DW_AT_prototyped  : 1
    <35>   DW_AT_type        : <0x76>
    <39>   DW_AT_low_pc      : 0x1149
    <41>   DW_AT_high_pc     : 0x1c
    <49>   DW_AT_frame_base  : 1-байтовый блок: 9c 	(DW_OP_call_frame_cfa)
    <4b>   DW_AT_GNU_all_call_sites: 1
    <4b>   DW_AT_sibling     : <0x76>
 <2><4f>: номер аббревиатуры: 3 (DW_TAG_formal_parameter)
    <50>   DW_AT_name        : x
    <52>   DW_AT_decl_file   : 1
    <53>   DW_AT_decl_line   : 3
    <54>   DW_AT_decl_column : 21
    <55>   DW_AT_type        : <0x76>
    <59>   DW_AT_location    : 0xa (список местоположения)
    <5d>   DW_AT_GNU_locviews: 0x0
 <2><61>: номер аббревиатуры: 4 (DW_TAG_GNU_call_site)
    <62>   DW_AT_low_pc      : 0x115f
    <6a>   DW_AT_abstract_origin: <0x2d>
 <3><6e>: номер аббревиатуры: 5 (DW_TAG_GNU_call_site_parameter)
    <6f>   DW_AT_location    : 1-байтовый блок: 55 	(DW_OP_reg5 (rdi))
    <71>   DW_AT_GNU_call_site_value: 2-байтовый блок: 73 7f 	(DW_OP_breg3 (rbx): -1)
 <3><74>: номер аббревиатуры: 0
 <2><75>: номер аббревиатуры: 0
 <1><76>: номер аббревиатуры: 6 (DW_TAG_base_type)
    <77>   DW_AT_byte_size   : 4
    <78>   DW_AT_encoding    : 5	(signed)
    <79>   DW_AT_name        : int
 <1><7d>: номер аббревиатуры: 0
  Единица компиляции @ смещение 0x7e:
   Длина:           0x3b6 (32-bit)
   Версия:          4
   Смещ. аббрев:    0x68
   Разм. указат:    8
 <0><89>: номер аббревиатуры: 1 (DW_TAG_compile_unit)
    <8a>   DW_AT_producer    : (косвенная строка, смещение: 0x0): GNU C17 9.3.0 -mtune=generic -march=x86-64 -g -O1 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <8e>   DW_AT_language    : 12	(ANSI C99)
    <8f>   DW_AT_name        : (косвенная строка, смещение: 0x22b): main.c
    <93>   DW_AT_comp_dir    : (косвенная строка, смещение: 0x91): /home/kolobaka2000/Рабочий стол/mipt_contests/2_sem/7_th/fact
    <97>   DW_AT_low_pc      : 0x1165
    <9f>   DW_AT_high_pc     : 0x34
    <a7>   DW_AT_stmt_list   : 0x5b
 <1><ab>: номер аббревиатуры: 2 (DW_TAG_typedef)
    <ac>   DW_AT_name        : (косвенная строка, смещение: 0x119): size_t
    <b0>   DW_AT_decl_file   : 3
    <b1>   DW_AT_decl_line   : 209
    <b2>   DW_AT_decl_column : 23
    <b3>   DW_AT_type        : <0xb7>
 <1><b7>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <b8>   DW_AT_byte_size   : 8
    <b9>   DW_AT_encoding    : 7	(unsigned)
    <ba>   DW_AT_name        : (косвенная строка, смещение: 0x232): long unsigned int
 <1><be>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <bf>   DW_AT_byte_size   : 4
    <c0>   DW_AT_encoding    : 7	(unsigned)
    <c1>   DW_AT_name        : (косвенная строка, смещение: 0x237): unsigned int
 <1><c5>: номер аббревиатуры: 4 (DW_TAG_pointer_type)
    <c6>   DW_AT_byte_size   : 8
 <1><c7>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <c8>   DW_AT_byte_size   : 1
    <c9>   DW_AT_encoding    : 8	(unsigned char)
    <ca>   DW_AT_name        : (косвенная строка, смещение: 0x1a4): unsigned char
 <1><ce>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <cf>   DW_AT_byte_size   : 2
    <d0>   DW_AT_encoding    : 7	(unsigned)
    <d1>   DW_AT_name        : (косвенная строка, смещение: 0x1f3): short unsigned int
 <1><d5>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <d6>   DW_AT_byte_size   : 1
    <d7>   DW_AT_encoding    : 6	(signed char)
    <d8>   DW_AT_name        : (косвенная строка, смещение: 0x1a6): signed char
 <1><dc>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <dd>   DW_AT_byte_size   : 2
    <de>   DW_AT_encoding    : 5	(signed)
    <df>   DW_AT_name        : (косвенная строка, смещение: 0x10f): short int
 <1><e3>: номер аббревиатуры: 5 (DW_TAG_base_type)
    <e4>   DW_AT_byte_size   : 4
    <e5>   DW_AT_encoding    : 5	(signed)
    <e6>   DW_AT_name        : int
 <1><ea>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <eb>   DW_AT_byte_size   : 8
    <ec>   DW_AT_encoding    : 5	(signed)
    <ed>   DW_AT_name        : (косвенная строка, смещение: 0x17e): long int
 <1><f1>: номер аббревиатуры: 2 (DW_TAG_typedef)
    <f2>   DW_AT_name        : (косвенная строка, смещение: 0x25c): __off_t
    <f6>   DW_AT_decl_file   : 4
    <f7>   DW_AT_decl_line   : 152
    <f8>   DW_AT_decl_column : 25
    <f9>   DW_AT_type        : <0xea>
 <1><fd>: номер аббревиатуры: 2 (DW_TAG_typedef)
    <fe>   DW_AT_name        : (косвенная строка, смещение: 0x252): __off64_t
    <102>   DW_AT_decl_file   : 4
    <103>   DW_AT_decl_line   : 153
    <104>   DW_AT_decl_column : 27
    <105>   DW_AT_type        : <0xea>
 <1><109>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <10a>   DW_AT_byte_size   : 8
    <10b>   DW_AT_type        : <0x10f>
 <1><10f>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <110>   DW_AT_byte_size   : 1
    <111>   DW_AT_encoding    : 6	(signed char)
    <112>   DW_AT_name        : (косвенная строка, смещение: 0x1ad): char
 <1><116>: номер аббревиатуры: 7 (DW_TAG_const_type)
    <117>   DW_AT_type        : <0x10f>
 <1><11b>: номер аббревиатуры: 8 (DW_TAG_structure_type)
    <11c>   DW_AT_name        : (косвенная строка, смещение: 0x19b): _IO_FILE
    <120>   DW_AT_byte_size   : 216
    <121>   DW_AT_decl_file   : 5
    <122>   DW_AT_decl_line   : 49
    <123>   DW_AT_decl_column : 8
    <124>   DW_AT_sibling     : <0x2a2>
 <2><128>: номер аббревиатуры: 9 (DW_TAG_member)
    <129>   DW_AT_name        : (косвенная строка, смещение: 0x12e): _flags
    <12d>   DW_AT_decl_file   : 5
    <12e>   DW_AT_decl_line   : 51
    <12f>   DW_AT_decl_column : 7
    <130>   DW_AT_type        : <0xe3>
    <134>   DW_AT_data_member_location: 0
 <2><135>: номер аббревиатуры: 9 (DW_TAG_member)
    <136>   DW_AT_name        : (косвенная строка, смещение: 0x1df): _IO_read_ptr
    <13a>   DW_AT_decl_file   : 5
    <13b>   DW_AT_decl_line   : 54
    <13c>   DW_AT_decl_column : 9
    <13d>   DW_AT_type        : <0x109>
    <141>   DW_AT_data_member_location: 8
 <2><142>: номер аббревиатуры: 9 (DW_TAG_member)
    <143>   DW_AT_name        : (косвенная строка, смещение: 0x14b): _IO_read_end
    <147>   DW_AT_decl_file   : 5
    <148>   DW_AT_decl_line   : 55
    <149>   DW_AT_decl_column : 9
    <14a>   DW_AT_type        : <0x109>
    <14e>   DW_AT_data_member_location: 16
 <2><14f>: номер аббревиатуры: 9 (DW_TAG_member)
    <150>   DW_AT_name        : (косвенная строка, смещение: 0x29d): _IO_read_base
    <154>   DW_AT_decl_file   : 5
    <155>   DW_AT_decl_line   : 56
    <156>   DW_AT_decl_column : 9
    <157>   DW_AT_type        : <0x109>
    <15b>   DW_AT_data_member_location: 24
 <2><15c>: номер аббревиатуры: 9 (DW_TAG_member)
    <15d>   DW_AT_name        : (косвенная строка, смещение: 0x1c7): _IO_write_base
    <161>   DW_AT_decl_file   : 5
    <162>   DW_AT_decl_line   : 57
    <163>   DW_AT_decl_column : 9
    <164>   DW_AT_type        : <0x109>
    <168>   DW_AT_data_member_location: 32
 <2><169>: номер аббревиатуры: 9 (DW_TAG_member)
    <16a>   DW_AT_name        : (косвенная строка, смещение: 0x120): _IO_write_ptr
    <16e>   DW_AT_decl_file   : 5
    <16f>   DW_AT_decl_line   : 58
    <170>   DW_AT_decl_column : 9
    <171>   DW_AT_type        : <0x109>
    <175>   DW_AT_data_member_location: 40
 <2><176>: номер аббревиатуры: 9 (DW_TAG_member)
    <177>   DW_AT_name        : (косвенная строка, смещение: 0x244): _IO_write_end
    <17b>   DW_AT_decl_file   : 5
    <17c>   DW_AT_decl_line   : 59
    <17d>   DW_AT_decl_column : 9
    <17e>   DW_AT_type        : <0x109>
    <182>   DW_AT_data_member_location: 48
 <2><183>: номер аббревиатуры: 9 (DW_TAG_member)
    <184>   DW_AT_name        : (косвенная строка, смещение: 0x135): _IO_buf_base
    <188>   DW_AT_decl_file   : 5
    <189>   DW_AT_decl_line   : 60
    <18a>   DW_AT_decl_column : 9
    <18b>   DW_AT_type        : <0x109>
    <18f>   DW_AT_data_member_location: 56
 <2><190>: номер аббревиатуры: 9 (DW_TAG_member)
    <191>   DW_AT_name        : (косвенная строка, смещение: 0xe1): _IO_buf_end
    <195>   DW_AT_decl_file   : 5
    <196>   DW_AT_decl_line   : 61
    <197>   DW_AT_decl_column : 9
    <198>   DW_AT_type        : <0x109>
    <19c>   DW_AT_data_member_location: 64
 <2><19d>: номер аббревиатуры: 9 (DW_TAG_member)
    <19e>   DW_AT_name        : (косвенная строка, смещение: 0x2ba): _IO_save_base
    <1a2>   DW_AT_decl_file   : 5
    <1a3>   DW_AT_decl_line   : 64
    <1a4>   DW_AT_decl_column : 9
    <1a5>   DW_AT_type        : <0x109>
    <1a9>   DW_AT_data_member_location: 72
 <2><1aa>: номер аббревиатуры: 9 (DW_TAG_member)
    <1ab>   DW_AT_name        : (косвенная строка, смещение: 0x279): _IO_backup_base
    <1af>   DW_AT_decl_file   : 5
    <1b0>   DW_AT_decl_line   : 65
    <1b1>   DW_AT_decl_column : 9
    <1b2>   DW_AT_type        : <0x109>
    <1b6>   DW_AT_data_member_location: 80
 <2><1b7>: номер аббревиатуры: 9 (DW_TAG_member)
    <1b8>   DW_AT_name        : (косвенная строка, смещение: 0x102): _IO_save_end
    <1bc>   DW_AT_decl_file   : 5
    <1bd>   DW_AT_decl_line   : 66
    <1be>   DW_AT_decl_column : 9
    <1bf>   DW_AT_type        : <0x109>
    <1c3>   DW_AT_data_member_location: 88
 <2><1c4>: номер аббревиатуры: 9 (DW_TAG_member)
    <1c5>   DW_AT_name        : (косвенная строка, смещение: 0x142): _markers
    <1c9>   DW_AT_decl_file   : 5
    <1ca>   DW_AT_decl_line   : 68
    <1cb>   DW_AT_decl_column : 22
    <1cc>   DW_AT_type        : <0x2bb>
    <1d0>   DW_AT_data_member_location: 96
 <2><1d1>: номер аббревиатуры: 9 (DW_TAG_member)
    <1d2>   DW_AT_name        : (косвенная строка, смещение: 0x264): _chain
    <1d6>   DW_AT_decl_file   : 5
    <1d7>   DW_AT_decl_line   : 70
    <1d8>   DW_AT_decl_column : 20
    <1d9>   DW_AT_type        : <0x2c1>
    <1dd>   DW_AT_data_member_location: 104
 <2><1de>: номер аббревиатуры: 9 (DW_TAG_member)
    <1df>   DW_AT_name        : (косвенная строка, смещение: 0x2d4): _fileno
    <1e3>   DW_AT_decl_file   : 5
    <1e4>   DW_AT_decl_line   : 72
    <1e5>   DW_AT_decl_column : 7
    <1e6>   DW_AT_type        : <0xe3>
    <1ea>   DW_AT_data_member_location: 112
 <2><1eb>: номер аббревиатуры: 9 (DW_TAG_member)
    <1ec>   DW_AT_name        : (косвенная строка, смещение: 0x28f): _flags2
    <1f0>   DW_AT_decl_file   : 5
    <1f1>   DW_AT_decl_line   : 73
    <1f2>   DW_AT_decl_column : 7
    <1f3>   DW_AT_type        : <0xe3>
    <1f7>   DW_AT_data_member_location: 116
 <2><1f8>: номер аббревиатуры: 9 (DW_TAG_member)
    <1f9>   DW_AT_name        : (косвенная строка, смещение: 0xed): _old_offset
    <1fd>   DW_AT_decl_file   : 5
    <1fe>   DW_AT_decl_line   : 74
    <1ff>   DW_AT_decl_column : 11
    <200>   DW_AT_type        : <0xf1>
    <204>   DW_AT_data_member_location: 120
 <2><205>: номер аббревиатуры: 9 (DW_TAG_member)
    <206>   DW_AT_name        : (косвенная строка, смещение: 0x165): _cur_column
    <20a>   DW_AT_decl_file   : 5
    <20b>   DW_AT_decl_line   : 77
    <20c>   DW_AT_decl_column : 18
    <20d>   DW_AT_type        : <0xce>
    <211>   DW_AT_data_member_location: 128
 <2><212>: номер аббревиатуры: 9 (DW_TAG_member)
    <213>   DW_AT_name        : (косвенная строка, смещение: 0x2ab): _vtable_offset
    <217>   DW_AT_decl_file   : 5
    <218>   DW_AT_decl_line   : 78
    <219>   DW_AT_decl_column : 15
    <21a>   DW_AT_type        : <0xd5>
    <21e>   DW_AT_data_member_location: 130
 <2><21f>: номер аббревиатуры: 9 (DW_TAG_member)
    <220>   DW_AT_name        : (косвенная строка, смещение: 0x1bd): _shortbuf
    <224>   DW_AT_decl_file   : 5
    <225>   DW_AT_decl_line   : 79
    <226>   DW_AT_decl_column : 8
    <227>   DW_AT_type        : <0x2c7>
    <22b>   DW_AT_data_member_location: 131
 <2><22c>: номер аббревиатуры: 9 (DW_TAG_member)
    <22d>   DW_AT_name        : (косвенная строка, смещение: 0x178): _lock
    <231>   DW_AT_decl_file   : 5
    <232>   DW_AT_decl_line   : 81
    <233>   DW_AT_decl_column : 15
    <234>   DW_AT_type        : <0x2d7>
    <238>   DW_AT_data_member_location: 136
 <2><239>: номер аббревиатуры: 9 (DW_TAG_member)
    <23a>   DW_AT_name        : (косвенная строка, смещение: 0xf1): _offset
    <23e>   DW_AT_decl_file   : 5
    <23f>   DW_AT_decl_line   : 89
    <240>   DW_AT_decl_column : 13
    <241>   DW_AT_type        : <0xfd>
    <245>   DW_AT_data_member_location: 144
 <2><246>: номер аббревиатуры: 9 (DW_TAG_member)
    <247>   DW_AT_name        : (косвенная строка, смещение: 0x21c): _codecvt
    <24b>   DW_AT_decl_file   : 5
    <24c>   DW_AT_decl_line   : 91
    <24d>   DW_AT_decl_column : 23
    <24e>   DW_AT_type        : <0x2e2>
    <252>   DW_AT_data_member_location: 152
 <2><253>: номер аббревиатуры: 9 (DW_TAG_member)
    <254>   DW_AT_name        : (косвенная строка, смещение: 0x26e): _wide_data
    <258>   DW_AT_decl_file   : 5
    <259>   DW_AT_decl_line   : 92
    <25a>   DW_AT_decl_column : 25
    <25b>   DW_AT_type        : <0x2ed>
    <25f>   DW_AT_data_member_location: 160
 <2><260>: номер аббревиатуры: 9 (DW_TAG_member)
    <261>   DW_AT_name        : (косвенная строка, смещение: 0x20b): _freeres_list
    <265>   DW_AT_decl_file   : 5
    <266>   DW_AT_decl_line   : 93
    <267>   DW_AT_decl_column : 20
    <268>   DW_AT_type        : <0x2c1>
    <26c>   DW_AT_data_member_location: 168
 <2><26d>: номер аббревиатуры: 9 (DW_TAG_member)
    <26e>   DW_AT_name        : (косвенная строка, смещение: 0x158): _freeres_buf
    <272>   DW_AT_decl_file   : 5
    <273>   DW_AT_decl_line   : 94
    <274>   DW_AT_decl_column : 9
    <275>   DW_AT_type        : <0xc5>
    <279>   DW_AT_data_member_location: 176
 <2><27a>: номер аббревиатуры: 9 (DW_TAG_member)
    <27b>   DW_AT_name        : (косвенная строка, смещение: 0x1ec): __pad5
    <27f>   DW_AT_decl_file   : 5
    <280>   DW_AT_decl_line   : 95
    <281>   DW_AT_decl_column : 10
    <282>   DW_AT_type        : <0xab>
    <286>   DW_AT_data_member_location: 184
 <2><287>: номер аббревиатуры: 9 (DW_TAG_member)
    <288>   DW_AT_name        : (косвенная строка, смещение: 0x297): _mode
    <28c>   DW_AT_decl_file   : 5
    <28d>   DW_AT_decl_line   : 96
    <28e>   DW_AT_decl_column : 7
    <28f>   DW_AT_type        : <0xe3>
    <293>   DW_AT_data_member_location: 192
 <2><294>: номер аббревиатуры: 9 (DW_TAG_member)
    <295>   DW_AT_name        : (косвенная строка, смещение: 0x1d6): _unused2
    <299>   DW_AT_decl_file   : 5
    <29a>   DW_AT_decl_line   : 98
    <29b>   DW_AT_decl_column : 8
    <29c>   DW_AT_type        : <0x2f3>
    <2a0>   DW_AT_data_member_location: 196
 <2><2a1>: номер аббревиатуры: 0
 <1><2a2>: номер аббревиатуры: 2 (DW_TAG_typedef)
    <2a3>   DW_AT_name        : (косвенная строка, смещение: 0x19f): FILE
    <2a7>   DW_AT_decl_file   : 6
    <2a8>   DW_AT_decl_line   : 7
    <2a9>   DW_AT_decl_column : 25
    <2aa>   DW_AT_type        : <0x11b>
 <1><2ae>: номер аббревиатуры: 10 (DW_TAG_typedef)
    <2af>   DW_AT_name        : (косвенная строка, смещение: 0x2e3): _IO_lock_t
    <2b3>   DW_AT_decl_file   : 5
    <2b4>   DW_AT_decl_line   : 43
    <2b5>   DW_AT_decl_column : 14
 <1><2b6>: номер аббревиатуры: 11 (DW_TAG_structure_type)
    <2b7>   DW_AT_name        : (косвенная строка, смещение: 0x1b2): _IO_marker
    <2bb>   DW_AT_declaration : 1
 <1><2bb>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <2bc>   DW_AT_byte_size   : 8
    <2bd>   DW_AT_type        : <0x2b6>
 <1><2c1>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <2c2>   DW_AT_byte_size   : 8
    <2c3>   DW_AT_type        : <0x11b>
 <1><2c7>: номер аббревиатуры: 12 (DW_TAG_array_type)
    <2c8>   DW_AT_type        : <0x10f>
    <2cc>   DW_AT_sibling     : <0x2d7>
 <2><2d0>: номер аббревиатуры: 13 (DW_TAG_subrange_type)
    <2d1>   DW_AT_type        : <0xb7>
    <2d5>   DW_AT_upper_bound : 0
 <2><2d6>: номер аббревиатуры: 0
 <1><2d7>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <2d8>   DW_AT_byte_size   : 8
    <2d9>   DW_AT_type        : <0x2ae>
 <1><2dd>: номер аббревиатуры: 11 (DW_TAG_structure_type)
    <2de>   DW_AT_name        : (косвенная строка, смещение: 0x219): _IO_codecvt
    <2e2>   DW_AT_declaration : 1
 <1><2e2>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <2e3>   DW_AT_byte_size   : 8
    <2e4>   DW_AT_type        : <0x2dd>
 <1><2e8>: номер аббревиатуры: 11 (DW_TAG_structure_type)
    <2e9>   DW_AT_name        : (косвенная строка, смещение: 0x26b): _IO_wide_data
    <2ed>   DW_AT_declaration : 1
 <1><2ed>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <2ee>   DW_AT_byte_size   : 8
    <2ef>   DW_AT_type        : <0x2e8>
 <1><2f3>: номер аббревиатуры: 12 (DW_TAG_array_type)
    <2f4>   DW_AT_type        : <0x10f>
    <2f8>   DW_AT_sibling     : <0x303>
 <2><2fc>: номер аббревиатуры: 13 (DW_TAG_subrange_type)
    <2fd>   DW_AT_type        : <0xb7>
    <301>   DW_AT_upper_bound : 19
 <2><302>: номер аббревиатуры: 0
 <1><303>: номер аббревиатуры: 14 (DW_TAG_variable)
    <304>   DW_AT_name        : (косвенная строка, смещение: 0x289): stdin
    <308>   DW_AT_decl_file   : 7
    <309>   DW_AT_decl_line   : 137
    <30a>   DW_AT_decl_column : 14
    <30b>   DW_AT_type        : <0x30f>
    <30f>   DW_AT_external    : 1
    <30f>   DW_AT_declaration : 1
 <1><30f>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <310>   DW_AT_byte_size   : 8
    <311>   DW_AT_type        : <0x2a2>
 <1><315>: номер аббревиатуры: 14 (DW_TAG_variable)
    <316>   DW_AT_name        : (косвенная строка, смещение: 0x2dc): stdout
    <31a>   DW_AT_decl_file   : 7
    <31b>   DW_AT_decl_line   : 138
    <31c>   DW_AT_decl_column : 14
    <31d>   DW_AT_type        : <0x30f>
    <321>   DW_AT_external    : 1
    <321>   DW_AT_declaration : 1
 <1><321>: номер аббревиатуры: 14 (DW_TAG_variable)
    <322>   DW_AT_name        : (косвенная строка, смещение: 0x171): stderr
    <326>   DW_AT_decl_file   : 7
    <327>   DW_AT_decl_line   : 139
    <328>   DW_AT_decl_column : 14
    <329>   DW_AT_type        : <0x30f>
    <32d>   DW_AT_external    : 1
    <32d>   DW_AT_declaration : 1
 <1><32d>: номер аббревиатуры: 14 (DW_TAG_variable)
    <32e>   DW_AT_name        : (косвенная строка, смещение: 0xf9): sys_nerr
    <332>   DW_AT_decl_file   : 8
    <333>   DW_AT_decl_line   : 26
    <334>   DW_AT_decl_column : 12
    <335>   DW_AT_type        : <0xe3>
    <339>   DW_AT_external    : 1
    <339>   DW_AT_declaration : 1
 <1><339>: номер аббревиатуры: 12 (DW_TAG_array_type)
    <33a>   DW_AT_type        : <0x34f>
    <33e>   DW_AT_sibling     : <0x344>
