
a.out:     формат файла elf64-x86-64


Дизассемблирование раздела .interp:

0000000000000318 <.interp>:
 318:	2f                   	(bad)  
 319:	6c                   	insb   (%dx),%es:(%rdi)
 31a:	69 62 36 34 2f 6c 64 	imul   $0x646c2f34,0x36(%rdx),%esp
 321:	2d 6c 69 6e 75       	sub    $0x756e696c,%eax
 326:	78 2d                	js     355 <_init-0xcab>
 328:	78 38                	js     362 <_init-0xc9e>
 32a:	36 2d 36 34 2e 73    	ss sub $0x732e3436,%eax
 330:	6f                   	outsl  %ds:(%rsi),(%dx)
 331:	2e 32 00             	xor    %cs:(%rax),%al

Дизассемблирование раздела .note.gnu.property:

0000000000000338 <.note.gnu.property>:
 338:	04 00                	add    $0x0,%al
 33a:	00 00                	add    %al,(%rax)
 33c:	10 00                	adc    %al,(%rax)
 33e:	00 00                	add    %al,(%rax)
 340:	05 00 00 00 47       	add    $0x47000000,%eax
 345:	4e 55                	rex.WRX push %rbp
 347:	00 02                	add    %al,(%rdx)
 349:	00 00                	add    %al,(%rax)
 34b:	c0 04 00 00          	rolb   $0x0,(%rax,%rax,1)
 34f:	00 03                	add    %al,(%rbx)
 351:	00 00                	add    %al,(%rax)
 353:	00 00                	add    %al,(%rax)
 355:	00 00                	add    %al,(%rax)
	...

Дизассемблирование раздела .note.gnu.build-id:

0000000000000358 <.note.gnu.build-id>:
 358:	04 00                	add    $0x0,%al
 35a:	00 00                	add    %al,(%rax)
 35c:	14 00                	adc    $0x0,%al

  DW_CFA_def_cfa_offset: 16
  DW_CFA_offset: r15 (r15) at cfa-16
  DW_CFA_advance_loc: 9 to 000000000000129f
  DW_CFA_def_cfa_offset: 24
  DW_CFA_offset: r14 (r14) at cfa-24
  DW_CFA_advance_loc: 5 to 00000000000012a4
  DW_CFA_def_cfa_offset: 32
  DW_CFA_offset: r13 (r13) at cfa-32
  DW_CFA_advance_loc: 5 to 00000000000012a9
  DW_CFA_def_cfa_offset: 40
  DW_CFA_offset: r12 (r12) at cfa-40
  DW_CFA_advance_loc: 4 to 00000000000012ad
  DW_CFA_def_cfa_offset: 48
  DW_CFA_offset: r6 (rbp) at cfa-48
  DW_CFA_advance_loc: 8 to 00000000000012b5
  DW_CFA_def_cfa_offset: 56
  DW_CFA_offset: r3 (rbx) at cfa-56
  DW_CFA_advance_loc: 7 to 00000000000012bc
  DW_CFA_def_cfa_offset: 64
  DW_CFA_advance_loc: 46 to 00000000000012ea
  DW_CFA_def_cfa_offset: 56
  DW_CFA_advance_loc: 1 to 00000000000012eb
  DW_CFA_def_cfa_offset: 48
  DW_CFA_advance_loc: 1 to 00000000000012ec
  DW_CFA_def_cfa_offset: 40
  DW_CFA_advance_loc: 2 to 00000000000012ee
  DW_CFA_def_cfa_offset: 32
  DW_CFA_advance_loc: 2 to 00000000000012f0
  DW_CFA_def_cfa_offset: 24
  DW_CFA_advance_loc: 2 to 00000000000012f2
  DW_CFA_def_cfa_offset: 16
  DW_CFA_advance_loc: 2 to 00000000000012f4
  DW_CFA_def_cfa_offset: 8
  DW_CFA_nop

00000108 0000000000000010 0000010c FDE cie=00000000 pc=0000000000001300..0000000000001305
  DW_CFA_nop
  DW_CFA_nop
  DW_CFA_nop

0000011c ZERO terminator


Содержимое раздела .debug_aranges (загружено из a.out):

  Длина:                    44
  Версия:                   2
  Смещение в .debug_info:   0x0
  Разм. указат:             8
  Разм. сегм.:              0

    Адрес              Длина
    00000000000011a9 00000000000000e5 
    0000000000000000 0000000000000000 

Содержимое раздела .debug_info (загружено из a.out):

  Единица компиляции @ смещение 0x0:
   Длина:           0x4b0 (32-bit)
   Версия:          4
   Смещ. аббрев:    0x0
   Разм. указат:    8
 <0><b>: номер аббревиатуры: 1 (DW_TAG_compile_unit)
    <c>   DW_AT_producer    : (косвенная строка, смещение: 0x139): GNU C17 9.3.0 -mtune=generic -march=x86-64 -g -O1 -fasynchronous-unwind-tables -fstack-protector-strong -fstack-clash-protection -fcf-protection
    <10>   DW_AT_language    : 12	(ANSI C99)
    <11>   DW_AT_name        : (косвенная строка, смещение: 0x25): problem_ap.c
    <15>   DW_AT_comp_dir    : (косвенная строка, смещение: 0xcd): /home/kolobaka2000/Рабочий стол/mipt_contests/2_sem/7_th/Problem_AP
    <19>   DW_AT_low_pc      : 0x11a9
    <21>   DW_AT_high_pc     : 0xe5
    <29>   DW_AT_stmt_list   : 0x0
 <1><2d>: номер аббревиатуры: 2 (DW_TAG_typedef)
    <2e>   DW_AT_name        : (косвенная строка, смещение: 0x52): size_t
    <32>   DW_AT_decl_file   : 3
    <33>   DW_AT_decl_line   : 209
    <34>   DW_AT_decl_column : 23
    <35>   DW_AT_type        : <0x39>
 <1><39>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <3a>   DW_AT_byte_size   : 8
    <3b>   DW_AT_encoding    : 7	(unsigned)
    <3c>   DW_AT_name        : (косвенная строка, смещение: 0x26b): long unsigned int
 <1><40>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <41>   DW_AT_byte_size   : 4
    <42>   DW_AT_encoding    : 7	(unsigned)
    <43>   DW_AT_name        : (косвенная строка, смещение: 0x270): unsigned int
 <1><47>: номер аббревиатуры: 4 (DW_TAG_pointer_type)
    <48>   DW_AT_byte_size   : 8
 <1><49>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <4a>   DW_AT_byte_size   : 1
    <4b>   DW_AT_encoding    : 8	(unsigned char)
    <4c>   DW_AT_name        : (косвенная строка, смещение: 0x1d3): unsigned char
 <1><50>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <51>   DW_AT_byte_size   : 2
    <52>   DW_AT_encoding    : 7	(unsigned)
    <53>   DW_AT_name        : (косвенная строка, смещение: 0x22c): short unsigned int
 <1><57>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <58>   DW_AT_byte_size   : 1
    <59>   DW_AT_encoding    : 6	(signed char)
    <5a>   DW_AT_name        : (косвенная строка, смещение: 0x1d5): signed char
 <1><5e>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <5f>   DW_AT_byte_size   : 2
    <60>   DW_AT_encoding    : 5	(signed)
    <61>   DW_AT_name        : (косвенная строка, смещение: 0x48): short int
 <1><65>: номер аббревиатуры: 5 (DW_TAG_base_type)
    <66>   DW_AT_byte_size   : 4
    <67>   DW_AT_encoding    : 5	(signed)
    <68>   DW_AT_name        : int
 <1><6c>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <6d>   DW_AT_byte_size   : 8
    <6e>   DW_AT_encoding    : 5	(signed)
    <6f>   DW_AT_name        : (косвенная строка, смещение: 0x129): long int
 <1><73>: номер аббревиатуры: 2 (DW_TAG_typedef)
    <74>   DW_AT_name        : (косвенная строка, смещение: 0x295): __off_t
    <78>   DW_AT_decl_file   : 4
    <79>   DW_AT_decl_line   : 152
    <7a>   DW_AT_decl_column : 25
    <7b>   DW_AT_type        : <0x6c>
 <1><7f>: номер аббревиатуры: 2 (DW_TAG_typedef)
    <80>   DW_AT_name        : (косвенная строка, смещение: 0x28b): __off64_t
    <84>   DW_AT_decl_file   : 4
    <85>   DW_AT_decl_line   : 153
    <86>   DW_AT_decl_column : 27
    <87>   DW_AT_type        : <0x6c>
 <1><8b>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <8c>   DW_AT_byte_size   : 8
    <8d>   DW_AT_type        : <0x91>
 <1><91>: номер аббревиатуры: 3 (DW_TAG_base_type)
    <92>   DW_AT_byte_size   : 1
    <93>   DW_AT_encoding    : 6	(signed char)
    <94>   DW_AT_name        : (косвенная строка, смещение: 0x1dc): char
 <1><98>: номер аббревиатуры: 7 (DW_TAG_const_type)
    <99>   DW_AT_type        : <0x91>
 <1><9d>: номер аббревиатуры: 8 (DW_TAG_structure_type)
    <9e>   DW_AT_name        : (косвенная строка, смещение: 0x1ca): _IO_FILE
    <a2>   DW_AT_byte_size   : 216
    <a3>   DW_AT_decl_file   : 5
    <a4>   DW_AT_decl_line   : 49
    <a5>   DW_AT_decl_column : 8
    <a6>   DW_AT_sibling     : <0x224>
 <2><aa>: номер аббревиатуры: 9 (DW_TAG_member)
    <ab>   DW_AT_name        : (косвенная строка, смещение: 0x8a): _flags
    <af>   DW_AT_decl_file   : 5
    <b0>   DW_AT_decl_line   : 51
    <b1>   DW_AT_decl_column : 7
    <b2>   DW_AT_type        : <0x65>
    <b6>   DW_AT_data_member_location: 0
 <2><b7>: номер аббревиатуры: 9 (DW_TAG_member)
    <b8>   DW_AT_name        : (косвенная строка, смещение: 0x21f): _IO_read_ptr
    <bc>   DW_AT_decl_file   : 5
    <bd>   DW_AT_decl_line   : 54
    <be>   DW_AT_decl_column : 9
    <bf>   DW_AT_type        : <0x8b>
    <c3>   DW_AT_data_member_location: 8
 <2><c4>: номер аббревиатуры: 9 (DW_TAG_member)
    <c5>   DW_AT_name        : (косвенная строка, смещение: 0xa7): _IO_read_end
    <c9>   DW_AT_decl_file   : 5
    <ca>   DW_AT_decl_line   : 55
    <cb>   DW_AT_decl_column : 9
    <cc>   DW_AT_type        : <0x8b>
    <d0>   DW_AT_data_member_location: 16
 <2><d1>: номер аббревиатуры: 9 (DW_TAG_member)
    <d2>   DW_AT_name        : (косвенная строка, смещение: 0x2d6): _IO_read_base
    <d6>   DW_AT_decl_file   : 5
    <d7>   DW_AT_decl_line   : 56
    <d8>   DW_AT_decl_column : 9
    <d9>   DW_AT_type        : <0x8b>
    <dd>   DW_AT_data_member_location: 24
 <2><de>: номер аббревиатуры: 9 (DW_TAG_member)
    <df>   DW_AT_name        : (косвенная строка, смещение: 0x1f6): _IO_write_base
    <e3>   DW_AT_decl_file   : 5
    <e4>   DW_AT_decl_line   : 57
    <e5>   DW_AT_decl_column : 9
    <e6>   DW_AT_type        : <0x8b>
    <ea>   DW_AT_data_member_location: 32
 <2><eb>: номер аббревиатуры: 9 (DW_TAG_member)
    <ec>   DW_AT_name        : (косвенная строка, смещение: 0x7c): _IO_write_ptr
    <f0>   DW_AT_decl_file   : 5
    <f1>   DW_AT_decl_line   : 58
    <f2>   DW_AT_decl_column : 9
    <f3>   DW_AT_type        : <0x8b>
    <f7>   DW_AT_data_member_location: 40
 <2><f8>: номер аббревиатуры: 9 (DW_TAG_member)
    <f9>   DW_AT_name        : (косвенная строка, смещение: 0x27d): _IO_write_end
    <fd>   DW_AT_decl_file   : 5
    <fe>   DW_AT_decl_line   : 59
    <ff>   DW_AT_decl_column : 9
    <100>   DW_AT_type        : <0x8b>
    <104>   DW_AT_data_member_location: 48
 <2><105>: номер аббревиатуры: 9 (DW_TAG_member)
    <106>   DW_AT_name        : (косвенная строка, смещение: 0x91): _IO_buf_base
    <10a>   DW_AT_decl_file   : 5
    <10b>   DW_AT_decl_line   : 60
    <10c>   DW_AT_decl_column : 9
    <10d>   DW_AT_type        : <0x8b>
    <111>   DW_AT_data_member_location: 56
 <2><112>: номер аббревиатуры: 9 (DW_TAG_member)
    <113>   DW_AT_name        : (косвенная строка, смещение: 0x0): _IO_buf_end
    <117>   DW_AT_decl_file   : 5
    <118>   DW_AT_decl_line   : 61
    <119>   DW_AT_decl_column : 9
    <11a>   DW_AT_type        : <0x8b>
    <11e>   DW_AT_data_member_location: 64
 <2><11f>: номер аббревиатуры: 9 (DW_TAG_member)
    <120>   DW_AT_name        : (косвенная строка, смещение: 0x2f9): _IO_save_base
    <124>   DW_AT_decl_file   : 5
    <125>   DW_AT_decl_line   : 64
    <126>   DW_AT_decl_column : 9
    <127>   DW_AT_type        : <0x8b>
    <12b>   DW_AT_data_member_location: 72
 <2><12c>: номер аббревиатуры: 9 (DW_TAG_member)
    <12d>   DW_AT_name        : (косвенная строка, смещение: 0x2b2): _IO_backup_base
    <131>   DW_AT_decl_file   : 5
    <132>   DW_AT_decl_line   : 65
    <133>   DW_AT_decl_column : 9
    <134>   DW_AT_type        : <0x8b>
    <138>   DW_AT_data_member_location: 80
 <2><139>: номер аббревиатуры: 9 (DW_TAG_member)
    <13a>   DW_AT_name        : (косвенная строка, смещение: 0x3b): _IO_save_end
    <13e>   DW_AT_decl_file   : 5
    <13f>   DW_AT_decl_line   : 66
    <140>   DW_AT_decl_column : 9
    <141>   DW_AT_type        : <0x8b>
    <145>   DW_AT_data_member_location: 88
 <2><146>: номер аббревиатуры: 9 (DW_TAG_member)
    <147>   DW_AT_name        : (косвенная строка, смещение: 0x9e): _markers
    <14b>   DW_AT_decl_file   : 5
    <14c>   DW_AT_decl_line   : 68
    <14d>   DW_AT_decl_column : 22
    <14e>   DW_AT_type        : <0x23d>
    <152>   DW_AT_data_member_location: 96
 <2><153>: номер аббревиатуры: 9 (DW_TAG_member)
    <154>   DW_AT_name        : (косвенная строка, смещение: 0x29d): _chain
    <158>   DW_AT_decl_file   : 5
    <159>   DW_AT_decl_line   : 70
    <15a>   DW_AT_decl_column : 20
    <15b>   DW_AT_type        : <0x243>
    <15f>   DW_AT_data_member_location: 104
 <2><160>: номер аббревиатуры: 9 (DW_TAG_member)
    <161>   DW_AT_name        : (косвенная строка, смещение: 0x313): _fileno
    <165>   DW_AT_decl_file   : 5
    <166>   DW_AT_decl_line   : 72
    <167>   DW_AT_decl_column : 7
    <168>   DW_AT_type        : <0x65>
    <16c>   DW_AT_data_member_location: 112
 <2><16d>: номер аббревиатуры: 9 (DW_TAG_member)
    <16e>   DW_AT_name        : (косвенная строка, смещение: 0x2c8): _flags2
    <172>   DW_AT_decl_file   : 5
    <173>   DW_AT_decl_line   : 73
    <174>   DW_AT_decl_column : 7
    <175>   DW_AT_type        : <0x65>
    <179>   DW_AT_data_member_location: 116
 <2><17a>: номер аббревиатуры: 9 (DW_TAG_member)
    <17b>   DW_AT_name        : (косвенная строка, смещение: 0xc): _old_offset
    <17f>   DW_AT_decl_file   : 5
    <180>   DW_AT_decl_line   : 74
    <181>   DW_AT_decl_column : 11
    <182>   DW_AT_type        : <0x73>
    <186>   DW_AT_data_member_location: 120
 <2><187>: номер аббревиатуры: 9 (DW_TAG_member)
    <188>   DW_AT_name        : (косвенная строка, смещение: 0xc1): _cur_column
    <18c>   DW_AT_decl_file   : 5
    <18d>   DW_AT_decl_line   : 77
    <18e>   DW_AT_decl_column : 18
    <18f>   DW_AT_type        : <0x50>
    <193>   DW_AT_data_member_location: 128
 <2><194>: номер аббревиатуры: 9 (DW_TAG_member)
    <195>   DW_AT_name        : (косвенная строка, смещение: 0x2ea): _vtable_offset
    <199>   DW_AT_decl_file   : 5
    <19a>   DW_AT_decl_line   : 78
    <19b>   DW_AT_decl_column : 15
    <19c>   DW_AT_type        : <0x57>
    <1a0>   DW_AT_data_member_location: 130
 <2><1a1>: номер аббревиатуры: 9 (DW_TAG_member)
    <1a2>   DW_AT_name        : (косвенная строка, смещение: 0x1ec): _shortbuf
    <1a6>   DW_AT_decl_file   : 5
    <1a7>   DW_AT_decl_line   : 79
    <1a8>   DW_AT_decl_column : 8
    <1a9>   DW_AT_type        : <0x249>
    <1ad>   DW_AT_data_member_location: 131
 <2><1ae>: номер аббревиатуры: 9 (DW_TAG_member)
    <1af>   DW_AT_name        : (косвенная строка, смещение: 0x123): _lock
    <1b3>   DW_AT_decl_file   : 5
    <1b4>   DW_AT_decl_line   : 81
    <1b5>   DW_AT_decl_column : 15
    <1b6>   DW_AT_type        : <0x259>
    <1ba>   DW_AT_data_member_location: 136
 <2><1bb>: номер аббревиатуры: 9 (DW_TAG_member)
    <1bc>   DW_AT_name        : (косвенная строка, смещение: 0x10): _offset
    <1c0>   DW_AT_decl_file   : 5
    <1c1>   DW_AT_decl_line   : 89
    <1c2>   DW_AT_decl_column : 13
    <1c3>   DW_AT_type        : <0x7f>
    <1c7>   DW_AT_data_member_location: 144
 <2><1c8>: номер аббревиатуры: 9 (DW_TAG_member)
    <1c9>   DW_AT_name        : (косвенная строка, смещение: 0x25c): _codecvt
    <1cd>   DW_AT_decl_file   : 5
    <1ce>   DW_AT_decl_line   : 91
    <1cf>   DW_AT_decl_column : 23
    <1d0>   DW_AT_type        : <0x264>
    <1d4>   DW_AT_data_member_location: 152
 <2><1d5>: номер аббревиатуры: 9 (DW_TAG_member)
    <1d6>   DW_AT_name        : (косвенная строка, смещение: 0x2a7): _wide_data
    <1da>   DW_AT_decl_file   : 5
    <1db>   DW_AT_decl_line   : 92
    <1dc>   DW_AT_decl_column : 25
    <1dd>   DW_AT_type        : <0x26f>
    <1e1>   DW_AT_data_member_location: 160
 <2><1e2>: номер аббревиатуры: 9 (DW_TAG_member)
    <1e3>   DW_AT_name        : (косвенная строка, смещение: 0x244): _freeres_list
    <1e7>   DW_AT_decl_file   : 5
    <1e8>   DW_AT_decl_line   : 93
    <1e9>   DW_AT_decl_column : 20
    <1ea>   DW_AT_type        : <0x243>
    <1ee>   DW_AT_data_member_location: 168
 <2><1ef>: номер аббревиатуры: 9 (DW_TAG_member)
    <1f0>   DW_AT_name        : (косвенная строка, смещение: 0xb4): _freeres_buf
    <1f4>   DW_AT_decl_file   : 5
    <1f5>   DW_AT_decl_line   : 94
    <1f6>   DW_AT_decl_column : 9
    <1f7>   DW_AT_type        : <0x47>
    <1fb>   DW_AT_data_member_location: 176
 <2><1fc>: номер аббревиатуры: 9 (DW_TAG_member)
    <1fd>   DW_AT_name        : (косвенная строка, смещение: 0x252): __pad5
    <201>   DW_AT_decl_file   : 5
    <202>   DW_AT_decl_line   : 95
    <203>   DW_AT_decl_column : 10
    <204>   DW_AT_type        : <0x2d>
    <208>   DW_AT_data_member_location: 184
 <2><209>: номер аббревиатуры: 9 (DW_TAG_member)
    <20a>   DW_AT_name        : (косвенная строка, смещение: 0x2d0): _mode
    <20e>   DW_AT_decl_file   : 5
    <20f>   DW_AT_decl_line   : 96
    <210>   DW_AT_decl_column : 7
    <211>   DW_AT_type        : <0x65>
    <215>   DW_AT_data_member_location: 192
 <2><216>: номер аббревиатуры: 9 (DW_TAG_member)
    <217>   DW_AT_name        : (косвенная строка, смещение: 0x205): _unused2
    <21b>   DW_AT_decl_file   : 5
    <21c>   DW_AT_decl_line   : 98
    <21d>   DW_AT_decl_column : 8
    <21e>   DW_AT_type        : <0x275>
    <222>   DW_AT_data_member_location: 196
 <2><223>: номер аббревиатуры: 0
 <1><224>: номер аббревиатуры: 2 (DW_TAG_typedef)
    <225>   DW_AT_name        : (косвенная строка, смещение: 0x1ce): FILE
    <229>   DW_AT_decl_file   : 6
    <22a>   DW_AT_decl_line   : 7
    <22b>   DW_AT_decl_column : 25
    <22c>   DW_AT_type        : <0x9d>
 <1><230>: номер аббревиатуры: 10 (DW_TAG_typedef)
    <231>   DW_AT_name        : (косвенная строка, смещение: 0x330): _IO_lock_t
    <235>   DW_AT_decl_file   : 5
    <236>   DW_AT_decl_line   : 43
    <237>   DW_AT_decl_column : 14
 <1><238>: номер аббревиатуры: 11 (DW_TAG_structure_type)
    <239>   DW_AT_name        : (косвенная строка, смещение: 0x1e1): _IO_marker
    <23d>   DW_AT_declaration : 1
 <1><23d>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <23e>   DW_AT_byte_size   : 8
    <23f>   DW_AT_type        : <0x238>
 <1><243>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <244>   DW_AT_byte_size   : 8
    <245>   DW_AT_type        : <0x9d>
 <1><249>: номер аббревиатуры: 12 (DW_TAG_array_type)
    <24a>   DW_AT_type        : <0x91>
    <24e>   DW_AT_sibling     : <0x259>
 <2><252>: номер аббревиатуры: 13 (DW_TAG_subrange_type)
    <253>   DW_AT_type        : <0x39>
    <257>   DW_AT_upper_bound : 0
 <2><258>: номер аббревиатуры: 0
 <1><259>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <25a>   DW_AT_byte_size   : 8
    <25b>   DW_AT_type        : <0x230>
 <1><25f>: номер аббревиатуры: 11 (DW_TAG_structure_type)
    <260>   DW_AT_name        : (косвенная строка, смещение: 0x259): _IO_codecvt
    <264>   DW_AT_declaration : 1
 <1><264>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <265>   DW_AT_byte_size   : 8
    <266>   DW_AT_type        : <0x25f>
 <1><26a>: номер аббревиатуры: 11 (DW_TAG_structure_type)
    <26b>   DW_AT_name        : (косвенная строка, смещение: 0x2a4): _IO_wide_data
    <26f>   DW_AT_declaration : 1
 <1><26f>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <270>   DW_AT_byte_size   : 8
    <271>   DW_AT_type        : <0x26a>
 <1><275>: номер аббревиатуры: 12 (DW_TAG_array_type)
    <276>   DW_AT_type        : <0x91>
    <27a>   DW_AT_sibling     : <0x285>
 <2><27e>: номер аббревиатуры: 13 (DW_TAG_subrange_type)
    <27f>   DW_AT_type        : <0x39>
    <283>   DW_AT_upper_bound : 19
 <2><284>: номер аббревиатуры: 0
 <1><285>: номер аббревиатуры: 14 (DW_TAG_variable)
    <286>   DW_AT_name        : (косвенная строка, смещение: 0x2c2): stdin
    <28a>   DW_AT_decl_file   : 7
    <28b>   DW_AT_decl_line   : 137
    <28c>   DW_AT_decl_column : 14
    <28d>   DW_AT_type        : <0x291>
    <291>   DW_AT_external    : 1
    <291>   DW_AT_declaration : 1
 <1><291>: номер аббревиатуры: 6 (DW_TAG_pointer_type)
    <292>   DW_AT_byte_size   : 8
    <293>   DW_AT_type        : <0x224>
 <1><297>: номер аббревиатуры: 14 (DW_TAG_variable)
    <298>   DW_AT_name        : (косвенная строка, смещение: 0x329): stdout
    <29c>   DW_AT_decl_file   : 7
    <29d>   DW_AT_decl_line   : 138
    <29e>   DW_AT_decl_column : 14
    <29f>   DW_AT_type        : <0x291>
    <2a3>   DW_AT_external    : 1
    <2a3>   DW_AT_declaration : 1
 <1><2a3>: номер аббревиатуры: 14 (DW_TAG_variable)
    <2a4>   DW_AT_name        : (косвенная строка, смещение: 0x11c): stderr
    <2a8>   DW_AT_decl_file   : 7
    <2a9>   DW_AT_decl_line   : 139
    <2aa>   DW_AT_decl_column : 14
    <2ab>   DW_AT_type        : <0x291>
    <2af>   DW_AT_external    : 1
    <2af>   DW_AT_declaration : 1
 <1><2af>: номер аббревиатуры: 14 (DW_TAG_variable)
    <2b0>   DW_AT_name        : (косвенная строка, смещение: 0x32): sys_nerr
    <2b4>   DW_AT_decl_file   : 8
    <2b5>   DW_AT_decl_line   : 26
    <2b6>   DW_AT_decl_column : 12
    <2b7>   DW_AT_type        : <0x65>
    <2bb>   DW_AT_external    : 1
    <2bb>   DW_AT_declaration : 1
 <1><2bb>: номер аббревиатуры: 12 (DW_TAG_array_type)
    <2bc>   DW_AT_type        : <0x2d1>
    <2c0>   DW_AT_sibling     : <0x2c6>
